Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/atdf/PIC32CZ4010CA90100S1.atdf
      <value-group name="LEVELB__LEVEL12">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL13">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL14">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELB__LEVEL15">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL16">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL17">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL18">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL19">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL20">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL21">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL22">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELC__LEVEL23">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL24">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL25">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL26">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
      <value-group name="LEVELD__LEVEL27">
        <value name="NONE" caption="No Action" value="0x0"/>
        <value name="HOSTIRQ" caption="Host Interrupt" value="0x1"/>
        <value name="LEHIRQ" caption="Log Event and Host Interrupt" value="0x2"/>
        <value name="SAFEMODE" caption="Enter Safe Mode" value="0x4"/>
        <value name="ERSTKEY" caption="Erase Tamper Key" value="0x5"/>
        <value name="ERSFKEY" caption="Erase Flash Key" value="0x6"/>
      </value-group>
